---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyIsCorruptError
source: html/fd56b6e1-77f4-de9f-5745-2eb5a4cfb0d3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyIsCorruptError Property

Some families have become unusable. Reload the families, or delete them from the model.

## Syntax (C#)
```csharp
public static FailureDefinitionId FamilyIsCorruptError { get; }
```